#Напишите программу, которая принимает
# на вход координаты двух точек и
# находит расстояние между ними в 2D пространстве.
#Пример:
#- A (3,6); B (2,1) -> 5,09
#- A (7,-5); B (1,-1) -> 7,21

print("Введите координату точки А по оси Х")
point_ax = int(input())
print("Введите координату точки А по оси Y")
point_ay = int(input())
print("Введите координату точки В по оси Х")
point_bx = int(input())
print("Введите координату точки В по оси У")
point_by = int(input())
print(f"Длина отрезка: {((point_ax - point_bx) ** 2 + (point_ay - point_by) ** 2) ** (0.5)}")